{
  "_num_labels": 1,
  "activation_function": "gelu_new",
  "architectures": [
    "PEARLM"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 4,
  "embd_pdrop": 0.1,
  "eos_token_id": 3,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 9,
  "n_embd": 4,
  "n_head": 2,
  "n_inner": null,
  "n_layer": 2,
  "n_positions": 9,
  "pad_token_id": 2,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "use_cache": true,
  "vocab_size": 35609
}
